company.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2015-11-17 Tue 00:28 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="viewport" content="width=device-width, initial-scale=1" />
<title>Company in Emacs</title>
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="shaka" />
<link rel="stylesheet" type="text/css" href="default.css"/>
</head>
<body>
<div id="content">
<h1 class="title">Company in Emacs</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgheadline1">1. Introduction</a></li>
<li><a href="#orgheadline2">2. Installation</a></li>
<li><a href="#orgheadline3">3. Configuration</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline1" class="outline-2">
<h2 id="orgheadline1"><span class="section-number-2">1</span> Introduction</h2>
<div class="outline-text-2" id="text-1">
<p>
<i>Auto-completion</i> is an important functionality in Emacs. It can greatly speed up our editing and programming. Generally speaking, the auto-completion can be divided into two parts, <i>frontend</i> and <i>backend</i>. As their names indicate, the former presents interface, while the latter provides contents. In a nutshell, the backend generates completion contents and feeds them to the frontend; then the frontend presents completion candidates to us for selection.
</p>

<p>
Up to now, there are a couple of popular frontends, <i>auto-complete</i><sup><a id="fnr.1" class="footref" href="#fn.1">1</a></sup> and <i>company</i><sup><a id="fnr.2" class="footref" href="#fn.2">2</a></sup>. "Company" stands for "complete anything". In fact, their functionalities are very similar. Both of them work well and their developments are fairly active. Both of them come with a variety of built-in backends. What deserves attention, for company, we can customize our own backends.
</p>

<p>
For myself, I have been using company. Its installation and configuration are briefly summarized in this blog.
</p>
</div>
</div>
<div id="outline-container-orgheadline2" class="outline-2">
<h2 id="orgheadline2"><span class="section-number-2">2</span> Installation</h2>
<div class="outline-text-2" id="text-2">
<p>
Company can be directly installed via ELPA.
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp">M-x package-install
company
</pre>
</div>
<p>
For C/C++ programming, <code>company-clang</code> is an excellent backend, it can provide company with the completion candidates based on the analysis and parsing from <i>clang</i>.
</p>

<p>
Addtionally, following two packages can be installed.
</p>
<dl class="org-dl">
<dt>company-c-headers</dt><dd>It enables clang to access the system headers, i.e. <code>/usr/include</code> and <code>/usr/local/include</code>.</dd>
<dt>company-auctex</dt><dd>It feeds company the completion from <i>auctex</i><sup><a id="fnr.3" class="footref" href="#fn.3">3</a></sup>.</dd>
</dl>
</div>
</div>
<div id="outline-container-orgheadline3" class="outline-2">
<h2 id="orgheadline3"><span class="section-number-2">3</span> Configuration</h2>
<div class="outline-text-2" id="text-3">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(global-company-mode 1)
(setq company-idle-delay -1)
(setq company-backends (delete 'company-semantic company-backends))
(add-to-list 'company-backends 'company-c-headers)
(company-auctex-init)
</pre>
</div>
<p>
Given a project, in order to enable completion based on the 3rd party libaries. A Emacs-Lisp script <code>.dir-locals.el</code> can be created and placed in the root of the project. Taking IT++ for instace, the content of <code>.dir-locals.el</code> can be listed below.
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp">((nil . ((company-clang-arguments . ("-I/opt/itpp/include")))))
</pre>
</div>
</div>
</div>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" class="footnum" href="#fnr.1">1</a></sup> <div class="footpara"><p class="footpara">
<a href="https://github.com/auto-complete/auto-complete">https://github.com/auto-complete/auto-complete</a>
</p></div></div>

<div class="footdef"><sup><a id="fn.2" class="footnum" href="#fnr.2">2</a></sup> <div class="footpara"><p class="footpara">
<a href="https://github.com/company-mode/company-mode">https://github.com/company-mode/company-mode</a>
</p></div></div>

<div class="footdef"><sup><a id="fn.3" class="footnum" href="#fnr.3">3</a></sup> <div class="footpara"><p class="footpara">
Auctex is also emacs package, and can be installed via ELPA.
</p></div></div>


</div>
</div></div>
<div id="postamble" class="status">
<p class="author">Author: shaka</p>
<p class="date">Created: 2015-11-17 Tue 00:28</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
